areiter128/SMPS-MCAL-PLIB/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_hsadc.c
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&ADCON3L);
    *regptr32 = ((adc_cfg.ADCON3.value & REG_ADCON3_DISABLE_ADC_CORES_MASK) & (REG_ADCON3_VALID_DATA_WRITE_MASK));
    regbuf32 = *regptr32;
    if(regbuf32 == ((adc_cfg.ADCON3.value & REG_ADCON3_DISABLE_ADC_CORES_MASK) & REG_ADCON3_VALID_DATA_WRITE_MASK))
    { fres &= 1; }
    else
    { fres = 0; }

	// Setting ADC configuration block #3 according to user settings.
    #if defined(ADCON4L)
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&ADCON4L);
    *regptr32 = (adc_cfg.ADCON4.value & (REG_ADCON4_VALID_DATA_WRITE_MASK));
    regbuf32 = *regptr32;
    if(regbuf32 == (adc_cfg.ADCON4.value & REG_ADCON4_VALID_DATA_WRITE_MASK))
    { fres &= 1; }
    else
    { fres = 0; }
    #endif
    
	// Setting ADC configuration block #5 according to user settings.
    
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&ADCON5L);
    *regptr32 = ((adc_cfg.ADCON5.value & REG_ADCON5_DISABLE_ADC_CORES_MASK) & (REG_ADCON5_VALID_DATA_WRITE_MASK));
    regbuf32 = *regptr32;
    if(regbuf32 == ((adc_cfg.ADCON5.value & REG_ADCON5_DISABLE_ADC_CORES_MASK) & REG_ADCON5_VALID_DATA_WRITE_MASK))
    { fres &= 1; }
    else
    { fres = 0; }


    // Return 1=success, 0=failure
	return(fres);

}


/*!hsadc_init_adc_channel
 * ************************************************************************************************
 * Summary:
 * Initializes an individual ADC input configuration
 *
 * Parameters:
 *	HSADC_CHANNEL_CONFIG_t = holds all available settings of one ADC input (e.g. AN3)
 *
 * Description:
 * This routine configures the individual settings of an analog input .
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_init_adc_channel( HSADC_CHANNEL_CONFIG_t adin_cfg ) {
    
    volatile uint16_t fres = 1;
    
    // Check if given analog input number is available
    if(adin_cfg.ad_input > ADC_ANINPUT_COUNT) { return(0); }
    
    // Set AD input mode (differential or single ended)
    fres &= hsadc_set_adc_input_mode(adin_cfg.ad_input, 
            adin_cfg.config.bits.input_mode, adin_cfg.config.bits.data_mode);

    // Set interrupt enable and early interrupt enable
    fres &= hsadc_set_adc_input_interrupt(adin_cfg.ad_input, 
            adin_cfg.config.bits.interrupt_enable, adin_cfg.config.bits.early_interrupt_enable);
    
    // Set interrupt trigger source
    fres &= hsadc_set_adc_input_trigger_source(adin_cfg.ad_input, adin_cfg.config.bits.trigger_source);

    // Set interrupt trigger mode (level/edge)
    fres &= hsadc_set_adc_input_trigger_mode(adin_cfg.ad_input, adin_cfg.config.bits.trigger_mode);

    return(fres);
    
}


/*!hsadc_init_adc_core
 * ************************************************************************************************
 * Summary:
 * Initializes an individual ADC Core configuration
 *
 * Parameters:
 *	regADCORExL	= holds the register value for the ADCORExL register
 *	regADCORExH	= holds the register value for the ADCORExL register
 *
 * Description:
 * Basic options like conversion delay, early interrupt period, ADC resolution and input clock
 * dividers are set here.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_init_adc_core(uint16_t index, uint16_t regADCORExL, uint16_t regADCORExH)
{

volatile uint16_t *regptr;
volatile uint16_t reg_buf=0;

#if defined (ADCORE0L)
volatile uint16_t reg_offset=0;
#endif

	if (index >= ADC_CORE_COUNT) return(0);

    if(index != ADC_SHARED_CORE_INDEX)
    {
        // dedicated cores have their individual configuration 
        // registers ADCORExL and ADCORExH
        
        #if defined (ADCORE0L)
        // Dual core devices like dsPIC33CH only have shared cores on the master side.
        // Only slave cores have multiple, dedicated cores
        
        reg_offset = ( index * ADC_ADCORE_REG_OFFSET );
        regptr = (volatile uint16_t *)&ADCORE0L + reg_offset;
        reg_buf = (regADCORExL & REG_ADCORExL_VALID_DATA_MSK);
        if((*regptr & REG_ADCORExL_VALID_DATA_MSK) != reg_buf)
        { *regptr = reg_buf; }

        regptr = (volatile uint16_t *)&ADCORE0H + reg_offset;
        reg_buf = (regADCORExH & REG_ADCORExH_VALID_DATA_MSK);
        if((*regptr & REG_ADCORExH_VALID_DATA_MSK) != reg_buf)
        { *regptr = reg_buf; }

        #endif
        
    }
    else
    {
    
        // the configuration of the shared core is incorporated into 
        // the generic registers ADCON2L and ADCON2H
        // Unfortunately register assignments of xxxH and xxxL are reversed
        // for shared and dedicated cores.... So don't get confused !!!
        
        regptr = (volatile uint16_t *)&ADCON2L;
        reg_buf = (*regptr & REG_ADCON2L_REF_CFG_MASK);  // Read bandgap reference register bits
        reg_buf |= (regADCORExH & REG_ADCON2L_SHRADC_CFG_MASK);
        if((*regptr & REG_ADCON2L_SHRADC_CFG_MASK) != (reg_buf & REG_ADCON2L_SHRADC_CFG_MASK))
        { *regptr = reg_buf; }

        
        regptr = (volatile uint16_t *)&ADCON2H;
        reg_buf = (*regptr & REG_ADCON2H_REF_CFG_MASK);  // Read bandgap reference register bits
        reg_buf |= (regADCORExL & REG_ADCON2H_SHRADC_CFG_MASK);
        if((*regptr & REG_ADCON2H_SHRADC_CFG_MASK) != (reg_buf & REG_ADCON2H_SHRADC_CFG_MASK))
        { *regptr = reg_buf; }
    
    }

    return(1);
    
}


/*!hsadc_module_enable()
 * ************************************************************************************************
 * Summary:
 * Enables the ADC module
 *
 * Parameters: (none)
 *
 * Description:
 * The ADC module has a start-up time of a couple of micro seconds. Therefore the 
 * enable-instruction is followed by a short delay loop.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_module_enable(void)
{

	ADCON1Lbits.ADON	= ADC_ON; 	// Enable ADC module
	return(ADCON1Lbits.ADON);
	 
