areiter128/SMPS-MCAL-PLIB/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_hsadc.c
}

/*!hsadc_module_disable()
 * ************************************************************************************************
 * Summary:
 * Disables the ADC module
 *
 * Parameters: (none)
 *
 * Description:
 * Disables the entire ADC module, which will also affect the port registers. Fault states 
 * at certain pins will be lost as every pin will be re-configured as GPIO.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_module_disable(void)
{

	ADCON1Lbits.ADON = ADC_OFF;			// Disable ADC module 

	return(1 - ADCON1Lbits.ADON);

}

/*!hsadc_reset()
 * ************************************************************************************************
 * Summary:
 * Resets ADC configuration
 *
 * Parameters:	(none)
 *
 * Description:
 * Resets the entire ADC configuration including the port control registers. All ANx-inputs will
 * become GPIOs.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_reset(void)
{
	// Reset all ADC configuration registers to defaults

	ADCON1Lbits.ADON = ADC_OFF;				// Disable ADC
  
	ADCON1L	   = REG_ADCON1L_RESET;			// Disable and reset ADC configuration register 1 low
	ADCON1H	   = REG_ADCON1H_RESET;			// Disable and reset ADC configuration register 1 high
	ADCON2L	   = REG_ADCON2L_RESET;			// Disable and reset ADC configuration register 2 low
	ADCON2H	   = REG_ADCON2H_RESET;			// Disable and reset ADC configuration register 2 high
    ADCON3L    = REG_ADCON3L_RESET;			// Disable and reset ADC configuration register 3 low
    ADCON3H    = REG_ADCON3H_RESET;			// Disable and reset ADC configuration register 3 high
    #if defined (ADCON4L)
    ADCON4L    = REG_ADCON4L_RESET;			// Disable and reset ADC configuration register 4 low
    #endif
    #if defined (ADCON4H)
    ADCON4H    = REG_ADCON4H_RESET;			// Disable and reset ADC configuration register 4 high
    #endif
    ADCON5L    = REG_ADCON5L_RESET;			// Disable and reset ADC configuration register 5 low
    ADCON5H    = REG_ADCON5H_RESET;			// Disable and reset ADC configuration register 5 high

    /* ToDo: Rework RESET routine to filter on available registers
    ADMOD0L    = REG_ADMOD0L_RESET;
    ADMOD0H    = REG_ADMOD0H_RESET;
    ADMOD1L    = REG_ADMOD1L_RESET;   
    ADMOD1H    = REG_ADMOD1H_RESET;     
    ADIEL      = REG_ADIEL_RESET;
    ADIEH      = REG_ADIEH_RESET;
    ADSTATL    = REG_ADSTATL_RESET;      
    ADSTATH    = REG_ADSTATH_RESET;  
    ADCMP0ENL  = REG_ADCMPxENL_RESET;
    ADCMP0ENH  = REG_ADCMPxENH_RESET; 
    ADCMP0LO   = REG_ADCMPxLO_RESET;
    ADCMP0HI   = REG_ADCMPxHI_RESET;
    ADCMP1ENL  = REG_ADCMPxENL_RESET;
    ADCMP1ENH  = REG_ADCMPxENH_RESET;
    ADCMP1HI   = REG_ADCMPxHI_RESET;
    ADCMP2ENL  = REG_ADCMPxENL_RESET;
    ADCMP2ENH  = REG_ADCMPxENH_RESET;
    ADCMP2LO   = REG_ADCMPxLO_RESET;
    ADCMP2HI   = REG_ADCMPxHI_RESET;
    ADCMP3ENL  = REG_ADCMPxENL_RESET;
    ADCMP3ENH  = REG_ADCMPxENH_RESET;
    ADCMP3LO   = REG_ADCMPxLO_RESET;
    ADCMP3HI   = REG_ADCMPxHI_RESET;
    ADFL0DAT   = REG_ADFLxDAT_RESET;
    ADFL0CON   = REG_ADFLxCON_RESET;
    ADFL1DAT   = REG_ADFLxDAT_RESET;
    ADFL1CON   = REG_ADFLxCON_RESET;
    ADFL2DAT   = REG_ADFLxDAT_RESET;
    ADFL2CON   = REG_ADFLxCON_RESET;
    ADFL3DAT   = REG_ADFLxDAT_RESET;
    ADFL3CON   = REG_ADFLxCON_RESET;
    ADTRIG0L   = REG_ADTRIGxL_TRGSRC_NONE;
    ADTRIG0H   = REG_ADTRIGxH_TRGSRC_NONE;
    ADTRIG1L   = REG_ADTRIGxL_TRGSRC_NONE;
    ADTRIG1H   = REG_ADTRIGxH_TRGSRC_NONE;
    ADTRIG2L   = REG_ADTRIGxL_TRGSRC_NONE;
    ADTRIG2H   = REG_ADTRIGxL_TRGSRC_NONE;
    ADTRIG3L   = REG_ADTRIGxL_TRGSRC_NONE;
    ADTRIG3H   = REG_ADTRIGxH_TRGSRC_NONE;
    ADTRIG4L   = REG_ADTRIGxL_TRGSRC_NONE;
    ADTRIG4H   = REG_ADTRIGxH_TRGSRC_NONE;
    ADTRIG5L   = REG_ADTRIGxL_TRGSRC_NONE;
    ADTRIG5H   = REG_ADTRIGxH_TRGSRC_NONE;
    ADTRIG6L   = REG_ADTRIGxL_TRGSRC_NONE;
    ADCMP0CON  = REG_ADCMPxCON_RESET;
    ADCMP1CON  = REG_ADCMPxCON_RESET;
    ADCMP2CON  = REG_ADCMPxCON_RESET;
    ADCMP3CON  = REG_ADCMPxCON_RESET;
    ADLVLTRGL  = REG_ADLVLTRGL_RESET;
    ADLVLTRGH  = REG_ADLVLTRGH_RESET;
    ADCORE0L   = REG_ADCORExL_RESET;
    ADCORE0H   = REG_ADCORExH_RESET;
    ADCORE1L   = REG_ADCORExL_RESET;
    ADCORE1H   = REG_ADCORExH_RESET;
    ADEIEL     = REG_ADEIEL_RESET;
    ADEIEH     = REG_ADEIEH_RESET;
    ADEISTATL  = REG_ADEISTATL_RESET;
    ADEISTATH  = REG_ADEISTATH_RESET;
    */
    
	return(1);
}

/*!hsadc_power_on_adc_core()
 * ************************************************************************************************
 * Summary:
 * Turns on a single ADC core considering warm-up time
 *
 * Parameters:	(none)
 *
 * Description:
 * The individual ADC cores of the ADC peripheral require a self calibration procedure 
 * to meet the values given in the data sheet. The following function performs the self
 * calibration of the given ADC core.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_check_adc_cores_ready(void)
{
    volatile uint16_t timeout = 0, rdy_compare = 0, reg_buf = 0;
    
    reg_buf = (ADCON5L & 0x00FF);
    rdy_compare = (reg_buf << 8);

    while( (((ADCON5L << 8) & 0xFF00) != rdy_compare) && (timeout++ < 0xFFFE) );
    if(timeout == 0xFFFF) return(0);
    else return(1);

}

/*!hsadc_calibrate_adc_core()
 * ************************************************************************************************
 * Summary:
 * Calls the ADC calibration of a single ADC core
 *
 * Parameters:	(none)
 *
 * Description:
 * The individual ADC cores of the ADC peripheral require a self calibration procedure 
 * to meet the values given in the data sheet. The following function performs the self
 * calibration of the given ADC core.
 * ***********************************************************************************************/
#if defined (__P33SMPS_EP__)
inline volatile uint16_t hsadc_calibrate_adc_core(uint16_t index, uint16_t calib_mode)
{
	volatile uint16_t timeout=0;
    volatile uint16_t *regptr;
    volatile uint16_t reg_offset=0;
    
    if (index >= ADC_CORE_COUNT) return(0);
    
